# Используем официальный образ Golang для сборки нашего приложения
FROM golang:1.18 as builder

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем go.mod и go.sum для установки зависимостей
COPY go.mod main.go ./

# Загружаем модули Go (зависимости)
RUN go mod download

# Копируем остальные файлы проекта в рабочую директорию
COPY . .

# Сборка приложения
RUN go build -o task main.go

# Используем минимальный образ для финального контейнера
FROM debian:buster-slim

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем скомпилированное приложение из контейнера сборки
COPY --from=builder /app/task .

# Копируем другие необходимые файлы (если есть)
COPY test.txt .

# Указываем команду по умолчанию для запуска
ENTRYPOINT ["./task"]

# Указываем аргумент по умолчанию (можно переопределить при запуске контейнера)
CMD ["test.txt"]
